name: "unet"
platform: "tensorrt_plan"
default_model_filename: "unet.plan"
max_batch_size: 0
input: [
  {
    name: "sample"
    data_type: TYPE_FP32
    dims: [-1, 4, 64, 64]
  },
  {
    name: "timestep"
    data_type: TYPE_INT32
    dims: [1]
  },
  {
    name: "encoder_hidden_states"
    data_type: TYPE_FP32
    dims: [-1, 2, 77, 768]
  }
]
output: [
  {
        name: "noise"
    data_type: TYPE_FP32
    dims: [-1, 4, 64, 64]
  }
]