name: "vae"
platform: "tensorrt_plan"
default_model_filename: "vae.plan"
max_batch_size: 0
input: [
  {
    name: "z",
    data_type: TYPE_FP32,
    dims: [-1, 4, 64, 64]
  }
]
output: [
  {
    name: "image",
    data_type: TYPE_FP32,
    dims: [-1, 3, 512, 512]
  }
]